{
  "P1": {
    "id": "P1",
    "title": "Social Mirroring Sensitivity",
    "subtitle": "This pattern reflects how you respond to subtle changes in communication.",
    "insight": "Your responses suggest a heightened awareness of relational dynamics. You tend to adjust your communication style based on perceived emotional shifts in others.",
    "supporting_bullets": [
      "You notice when someone’s tone or energy changes mid-conversation",
      "You interpret pauses or delayed replies as meaningful signals"
    ],
    "supporting_traits": [
      "Social Mirroring",
      "Timing Sensitivity"
    ]
  },
  "P2": {
    "id": "P2",
    "title": "Protective Withdrawal",
    "subtitle": "This pattern reflects how you respond when emotional uncertainty increases.",
    "insight": "Your answers show a tendency to create space when something feels unclear. You protect your emotional equilibrium by stepping back until you understand the situation better.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Boundary Vigilance",
      "Emotional Guarding"
    ]
  },
  "P3": {
    "id": "P3",
    "title": "Optimistic Projection",
    "subtitle": "This pattern reflects how you fill in emotional gaps during communication.",
    "insight": "You tend to assume positive intent when signals are ambiguous. This allows you to stay open and hopeful, even when information is incomplete.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Hopeful Framing",
      "Meaning Expansion"
    ]
  },
  "P4": {
    "id": "P4",
    "title": "Ambiguity Stress",
    "subtitle": "This pattern reflects how you react when communication signals feel inconsistent.",
    "insight": "You become more alert when messages don’t align. Conflicting cues make you pause and evaluate the emotional landscape before moving forward.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Signal Tracking",
      "Meaning Compression"
    ]
  },
  "P5": {
    "id": "P5",
    "title": "Connection Momentum",
    "subtitle": "This pattern reflects how you respond when a conversation feels emotionally aligned.",
    "insight": "Your responses suggest that when energy feels good, you naturally increase engagement. You match enthusiasm and may even amplify it to maintain the connection.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Engagement Flow",
      "Affection Surge"
    ]
  },
  "P6": {
    "id": "P6",
    "title": "Cautious Interpretation",
    "subtitle": "This pattern reflects how you process conversations when clarity is uncertain.",
    "insight": "You slow things down to avoid misreading signals. You prefer to gather context before assuming meaning, which keeps your emotional responses grounded.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Risk Assessment",
      "Emotional Deliberation"
    ]
  },
  "P7": {
    "id": "P7",
    "title": "Emotional Anchoring",
    "subtitle": "This pattern reflects how you use past signals to understand new ones.",
    "insight": "You rely on previous interactions to interpret what’s happening now. Consistency and track records matter to you and guide how you respond emotionally.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Baseline Reinforcement",
      "Pattern Consistency"
    ]
  },
  "P8": {
    "id": "P8",
    "title": "Narrative Completion",
    "subtitle": "This pattern reflects how you make sense of missing information.",
    "insight": "You tend to connect dots quickly. When something isn’t explicitly stated, you naturally construct a story to understand the emotional context.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Story Projection",
      "Sense-Making"
    ]
  },
  "P9": {
    "id": "P9",
    "title": "Empathic Overreach",
    "subtitle": "This pattern reflects how deeply you take on other people’s emotional cues.",
    "insight": "You absorb emotional signals intensely, sometimes reading more into a message than the sender intended. This often comes from strong empathy rather than insecurity.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Emotional Absorption",
      "Sensitivity Spike"
    ]
  },
  "P10": {
    "id": "P10",
    "title": "Independent Processing",
    "subtitle": "This pattern reflects how you handle emotional information privately.",
    "insight": "You prefer space to think things through. You often make sense of emotional cues internally before responding, which helps you feel grounded and in control.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Internal Framing",
      "Space-Making"
    ]
  },
  "P11": {
    "id": "P11",
    "title": "Reciprocity Mapping",
    "subtitle": "This pattern reflects how you match emotional depth and vulnerability.",
    "insight": "You respond proportionally to what others share. When someone opens up, you’re more likely to open up too — but you rarely go first without an emotional signal from them.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Vulnerability Matching",
      "Relational Tracking"
    ]
  },
  "P12": {
    "id": "P12",
    "title": "Meaning Sensitivity",
    "subtitle": "This pattern reflects how you interpret subtle shifts in communication.",
    "insight": "You assign meaning quickly based on small emotional cues. Even brief changes in timing, tone, or pacing can feel significant and shape how you respond.",
    "supporting_bullets": [],
    "supporting_traits": [
      "Social Mirroring",
      "Timing Sensitivity"
    ]
  }
}
