{
  "types": {
    "Steady Anchor": {
      "title": "The Steady Anchor",
      "short": "You bring reliability, emotional steadiness, and a grounded presence into relationships. People trust you because you're consistent.",
      "long": "You bring reliability, emotional steadiness, and a grounded presence into relationships. People trust you because you're consistent—your emotions don't swing wildly, and your interpretations tend to be measured rather than reactive. You're not easily thrown off course; stability is your quiet superpower.\n\nTrust for you builds slowly but securely. You don't rush into emotional intimacy, but once you choose someone, you offer a sense of safety that is rare. You tend to interpret situations pragmatically, without spiralling into assumptions or reading too much between the lines.\n\nUnder pressure, you stay composed, sometimes to the point of silence. The challenge is that your internal regulation can mask discomfort—you may withdraw emotionally while telling yourself everything is manageable. This can create a mismatch between what you feel and what you express, leaving others guessing.\n\nYour journey is about letting people see the small emotional shifts beneath your calm exterior. Your steadiness is an anchor, but letting others in—just a little—creates even deeper connection."
    },
    "Quiet Protector": {
      "title": "The Quiet Protector",
      "short": "You are observant, thoughtful, and emotionally perceptive, even if you don't always show it. You protect your inner world carefully.",
      "long": "You are observant, thoughtful, and emotionally perceptive, even if you don't always show it. You protect your inner world carefully, not out of fear, but out of discernment. You feel deeply but reveal your feelings slowly, allowing trust to unfold layer by layer.\n\nYour instinct is to read situations before acting. You notice subtleties—changes in tone, inconsistencies, the emotional undercurrents beneath words. When you trust someone, your loyalty and emotional generosity emerge in a way that feels deeply grounding.\n\nUnder stress, you tend to retreat inward to regroup. This withdrawal is a coping strategy, not a rejection—but it can confuse people who don't understand your internal process. At times, your interpretations may skew toward caution, especially when trust feels uncertain, creating a quiet contradiction between wanting connection and needing space.\n\nYour path forward involves letting others know what your silence means. When you share even a little of your internal world, relationships unfold more smoothly and others feel welcomed into your depth."
    },
    "Warm Connector": {
      "title": "The Warm Connector",
      "short": "You move through the world with emotional openness and a natural pull toward closeness. You feel safest when connection is mutual and alive.",
      "long": "You move through the world with emotional openness and a natural pull toward closeness. You feel safest when connection is mutual, responsive, and alive, and you tend to sense the emotional temperature of others before they even speak. Your warmth is real—it's not a performance—but it can sometimes put you in the position of holding the emotional space for everyone else.\n\nYour instinct to trust comes from a genuine belief in people's better selves. When that trust is reciprocated, you flourish; when it's unsettled, you may find yourself overthinking or working harder than necessary to restore harmony. You tend to take words to heart because you care deeply about meaning, tone, and intent.\n\nUnder stress, you may lean into caretaking or emotional pursuit—not because you're needy, but because connection is how you regain equilibrium. At times, your feelings and your interpretations can pull in different directions, creating internal contradiction: you may sense distress even when your mind tells you things are fine, or feel doubt even when someone reassures you.\n\nYour growth lies in recognising when to let others meet you halfway. Your presence is a gift, but it becomes even more powerful when it's matched with boundaries that protect your emotional clarity."
    },
    "Thoughtful Analyst": {
      "title": "The Thoughtful Analyst",
      "short": "You approach relationships with insight, curiosity, and a desire to understand. You think deeply before you feel fully.",
      "long": "You approach relationships with insight, curiosity, and a desire to understand. You think deeply before you feel fully, and you often analyse emotional dynamics as a way of finding meaning and coherence. You are naturally introspective, which gives you wisdom—but can also pull you into mental overactivity.\n\nYou trust in patterns, logic, and consistency. When the emotional world aligns with your reasoning, you feel secure; when it doesn't, you may find yourself revisiting conversations, re-evaluating intent, or searching for clarity. Your interpretations tend to be accurate, but sometimes lean toward caution, especially when stress rises.\n\nUnder pressure, your emotional stability remains strong, but your mind may become more active than your heart. This can create subtle contradictions—feeling one thing, explaining another. You rarely act impulsively; instead, you take your time to understand your reactions.\n\nYour growth lies in allowing emotional experiences to exist without needing immediate explanation. Your ability to see truth is powerful—but your capacity to feel truth is equally part of who you are."
    },
    "Independent Spirit": {
      "title": "The Independent Realist",
      "short": "You lead with autonomy, clarity, and a strong sense of self. You value emotional honesty in a grounded, practical way.",
      "long": "You lead with autonomy, clarity, and a strong sense of self. You value emotional honesty, but in a grounded, practical way—you prefer straightforward communication over emotional theatrics. You bring a sense of calm independence into relationships, and you expect the same from others.\n\nTrust for you is built through actions rather than declarations. Consistency matters. When someone shows up reliably, you relax; when they don't, you instinctively pull back. Your interpretations tend to be direct—if something feels off, you acknowledge it and adjust accordingly.\n\nUnder stress, you may become more self-contained, relying on your inner logic rather than shared emotional processing. Sometimes this creates an internal disconnect: your feelings signal one thing, your mind rationalises another, and you choose the interpretation that keeps you most steady.\n\nYour strength is your clarity. Your opportunity is allowing others into your emotional landscape without assuming it threatens your independence. When you do, relationships deepen in a way that feels both grounded and liberating."
    },
    "Growth-Seeker": {
      "title": "The Passionate Seeker",
      "short": "You feel intensely and live with emotional courage. You move toward depth, growth, honesty, and transformative connection.",
      "long": "You feel intensely and live with emotional courage. You move toward depth, growth, honesty, and transformative connection. You want relationships that are meaningful, alive, and expansive—and you give your heart fully when you feel secure.\n\nTrust excites you; uncertainty challenges you. When someone matches your sincerity, you open quickly and generously. Your interpretations tend to be expressive and relational—you look for meaning, intention, and emotional resonance.\n\nUnder stress, your emotional system becomes more active. You may feel pulled between desire for connection and fear of emotional inconsistency. This can create moments of internal contradiction—wanting closeness while questioning stability, seeking reassurance while wanting to be self-sufficient.\n\nYour vibrancy is your gift. The key is to balance emotional intensity with steadiness, allowing space for connection that grows without burning too brightly too fast."
    },
    "Spark-Driven Adventurer": {
      "title": "The Creative Free-Spirit",
      "short": "You move with spontaneity, emotional curiosity, and a desire for experiences that feel alive. You value connection and freedom equally.",
      "long": "You move with spontaneity, emotional curiosity, and a desire for experiences that feel alive. You value connection, but you also value freedom—your best relationships give you room to explore, expand, and express yourself authentically.\n\nYou trust through emotional honesty and energetic compatibility. You read emotional cues quickly and respond intuitively. Under stress, you may feel pulled between wanting connection and wanting space, which can create internal inconsistencies that others misinterpret.\n\nYour interpretations are imaginative and dynamic—you see possibilities others overlook. This creativity is a gift, but it can also amplify emotional reaction when stability feels threatened.\n\nYour growth lies in grounding your emotional impulses with just enough structure to create continuity without losing your sense of self."
    },
    "Reassurance Harmoniser": {
      "title": "The Gentle Harmoniser",
      "short": "You move through relationships with empathy, softness, and an instinct for emotional balance. You feel safest when communication is smooth.",
      "long": "You move through relationships with empathy, softness, and an instinct for emotional balance. You feel safest when communication is smooth and intentions are clear. You pick up on shifts in tone quickly and often work to restore harmony before things even escalate.\n\nYou trust through emotional consistency—when people show up with care, presence, and honesty. You tend to believe the best in others, and this allows you to form deep, nurturing bonds. Your interpretations are sensitive and often accurate, but under stress you may read too much into small changes, leading to inner tension.\n\nYour contradiction arises when your desire for peace overrides your needs. You may reassure others even when you're not fully settled internally. This can lead to emotional over-functioning, where you carry more of the relational load than intended.\n\nYour strength is your kindness. Your evolution comes from recognising that harmony doesn't always require self-sacrifice—sometimes it begins with speaking your truth."
    },
    "Compassionate Healer": {
      "title": "The Intuitive Idealist",
      "short": "You lead with imagination, emotional insight, and a desire for meaningful connection. You feel things vividly and sense patterns intuitively.",
      "long": "You lead with imagination, emotional insight, and a desire for meaningful connection. You feel things vividly and sense emotional patterns intuitively. Your inner world is rich, and relationships for you are both emotional and existential.\n\nYou trust through resonance—when someone's energy aligns with your values, your openness follows naturally. Your interpretations are layered and symbolic; you look for deeper themes, patterns, and emotional truths.\n\nUnder stress, your emotional landscape becomes more complex. You may misread neutrality as disconnection or withdraw into introspection to protect your sensitivity. Contradiction for you often comes from caring intensely but fearing emotional mismatch.\n\nYour gift is depth. Your opportunity is grounding that depth so it can be shared clearly, without becoming overwhelming for you or others."
    },
    "Purpose-Led Planner": {
      "title": "The Purpose-Led Planner",
      "short": "You move through relationships with intention, clarity, and long-term thinking. You are emotionally present but strategic.",
      "long": "You move through relationships with intention, clarity, and long-term thinking. You are emotionally present but strategic—wanting relationships that align with your values, goals, and sense of purpose.\n\nYou trust through logic and reliability. You open up more when someone demonstrates shared intention and emotional steadiness. Your interpretations are thoughtful and future-oriented, which helps you avoid drama but can create pressure when you over-analyse relational signals.\n\nStress may make you more vigilant—looking for patterns, anticipating outcomes, or managing emotional risk. This can create internal contradictions between wanting emotional spontaneity and wanting certainty.\n\nYour strength is your clarity of purpose. Your evolution lies in embracing emotional uncertainty as a natural part of connection, not a threat to it."
    },
    "Boundary-Minded Realist": {
      "title": "The Grounded Individualist",
      "short": "You approach relationships with clarity, intention, and a strong sense of personal boundaries. You value depth without sacrificing autonomy.",
      "long": "You approach relationships with clarity, intention, and a strong sense of personal boundaries. You value depth, but not at the cost of emotional autonomy. You're thoughtful about where you invest your energy, and you prefer relationships that move at a steady, considered pace.\n\nYou trust gradually. You observe, evaluate, and open when someone demonstrates consistency. Your interpretations are rational and tempered; you avoid emotional extremes and keep things grounded.\n\nUnder stress, you may become more self-reliant, pulling inward to avoid overwhelm. This can create subtle contradictions: you may care deeply but communicate sparingly, or feel connected but need space. Others sometimes mistake your calmness for distance.\n\nYour strength is your clarity. Your growth lies in letting others see the warmth beneath your independence—connection doesn't diminish your autonomy; it expands it."
    },
    "Intuitive Romantic": {
      "title": "The Structured Supporter",
      "short": "You bring reliability, thoughtfulness, and a steady relational rhythm. You value clarity, fairness, and mutual effort.",
      "long": "You bring reliability, thoughtfulness, and a steady relational rhythm. You value clarity, fairness, and mutual effort. You prefer to build relationships slowly, creating a foundation of trust through consistency and honest communication.\n\nYou trust through structure: predictable behaviour, open dialogue, and emotional clarity. Your interpretations tend to be practical and grounded, though under stress you may default to withdrawal to avoid conflict.\n\nContradiction shows up when you feel deeply but communicate cautiously—your emotional world is warmer than what you outwardly express. Your stability remains strong, though stress can make you temporarily more rigid or cautious.\n\nYour strength is loyalty. Your path forward is recognising that emotional expression supports connection as much as structure and steadiness do."
    }
  }
}
