{
  "P1": {
    "id": "P1",
    "title": "Social Mirroring Sensitivity",
    "core_meaning": "Attuned to emotional shifts.",
    "subtitle": "This pattern reflects how you respond to subtle changes in communication.",
    "insight": "Your responses suggest a heightened awareness of relational dynamics. You adjust your communication style based on perceived emotional shifts in others.",
    "supporting_bullets": [
      "You notice when someone's tone or energy changes mid conversation",
      "You interpret pauses or delayed replies as meaningful signals",
      "You adapt quickly to maintain emotional balance in the exchange"
    ],
    "supporting_traits": [
      "Social Mirroring",
      "Timing Sensitivity"
    ]
  },
  "P2": {
    "id": "P2",
    "title": "Protective Withdrawal",
    "core_meaning": "Creates space to stay steady.",
    "subtitle": "This pattern reflects how you respond when emotional uncertainty increases.",
    "insight": "Your answers show a tendency to create space when something feels unclear. You protect your emotional equilibrium by stepping back until you understand the situation better.",
    "supporting_bullets": [
      "You step back when communication feels unpredictable",
      "You prefer to regroup before re engaging",
      "You stabilise yourself through distance before responding"
    ],
    "supporting_traits": [
      "Boundary Vigilance",
      "Emotional Guarding"
    ]
  },
  "P3": {
    "id": "P3",
    "title": "Optimistic Projection",
    "core_meaning": "Assumes the good in others.",
    "subtitle": "This pattern reflects how you fill in emotional gaps during communication.",
    "insight": "You tend to assume positive intent when signals are ambiguous. This helps you stay open and hopeful even when the information is incomplete.",
    "supporting_bullets": [
      "You lean toward best case interpretations",
      "You maintain warmth despite uncertainty",
      "You give others emotional credit before clarity arrives"
    ],
    "supporting_traits": [
      "Hopeful Framing",
      "Meaning Expansion"
    ]
  },
  "P4": {
    "id": "P4",
    "title": "Ambiguity Stress",
    "core_meaning": "Seeks clarity when cues diverge.",
    "subtitle": "This pattern reflects how you react when communication signals feel inconsistent.",
    "insight": "You become more alert when messages do not align. Conflicting cues make you pause and evaluate the emotional landscape before moving forward.",
    "supporting_bullets": [
      "You double check meaning when signals clash",
      "You become more analytical under mixed messages",
      "You look for emotional clarity before you commit"
    ],
    "supporting_traits": [
      "Signal Tracking",
      "Meaning Compression"
    ]
  },
  "P5": {
    "id": "P5",
    "title": "Emotional Overextension",
    "core_meaning": "Leads with emotional effort.",
    "subtitle": "This pattern reflects how you invest emotionally during relational uncertainty.",
    "insight": "You tend to give additional emotional effort when something feels off. You may try to fix or stabilise the interaction through extra care or presence.",
    "supporting_bullets": [
      "You lean in when others pull back",
      "You try to repair emotional tension before it grows",
      "You often take responsibility for restoring harmony"
    ],
    "supporting_traits": [
      "Engagement Flow",
      "Affection Surge"
    ]
  },
  "P6": {
    "id": "P6",
    "title": "Guarded Interpretation",
    "core_meaning": "Opens slowly with certainty.",
    "subtitle": "This pattern reflects how you evaluate emotional risk in communication.",
    "insight": "You stay cautious until signals feel consistent. You prefer to confirm intent before allowing emotional openness.",
    "supporting_bullets": [
      "You look for evidence before trusting emotional cues",
      "You avoid quick assumptions in unclear situations",
      "You protect your emotional boundaries through careful reading"
    ],
    "supporting_traits": [
      "Risk Assessment",
      "Emotional Deliberation"
    ]
  },
  "P7": {
    "id": "P7",
    "title": "Reassurance Seeking",
    "core_meaning": "Thrives on emotional clarity.",
    "subtitle": "This pattern reflects how you stabilise emotional uncertainty.",
    "insight": "You look for clear signals to confirm relational safety. You prefer concrete cues to know where you stand.",
    "supporting_bullets": [
      "You notice quickly when reassurance is missing",
      "You value direct affirmation to calm uncertainty",
      "You become more expressive when seeking clarity"
    ],
    "supporting_traits": [
      "Baseline Reinforcement",
      "Pattern Consistency"
    ]
  },
  "P8": {
    "id": "P8",
    "title": "Idealised Connection",
    "core_meaning": "Sees the future before the present.",
    "subtitle": "This pattern reflects how you envision possibilities during emotional gaps.",
    "insight": "You fill unknown spaces with imagined potential. Your mind leans into what the connection could become rather than what is currently confirmed.",
    "supporting_bullets": [
      "You build emotional narratives from small cues",
      "You focus on future possibilities",
      "You are inspired by potential rather than limitation"
    ],
    "supporting_traits": [
      "Story Projection",
      "Sense-Making"
    ]
  },
  "P9": {
    "id": "P9",
    "title": "Defensive Interpretation",
    "core_meaning": "Self protection through caution.",
    "subtitle": "This pattern reflects how you protect yourself when signals feel sharp or inconsistent.",
    "insight": "You may interpret unclear cues as potential threats. This helps you stay safe but can temporarily narrow emotional openness.",
    "supporting_bullets": [
      "You scan for emotional inconsistencies quickly",
      "You react faster to potential negative cues",
      "You pull back to avoid being hurt"
    ],
    "supporting_traits": [
      "Emotional Absorption",
      "Sensitivity Spike"
    ]
  },
  "P10": {
    "id": "P10",
    "title": "Adaptive Pleasing",
    "core_meaning": "Stays connected through adaptability.",
    "subtitle": "This pattern reflects how you regulate connection through responsiveness.",
    "insight": "You adjust your behaviour to maintain harmony. You read the emotional needs of others and respond in a way that keeps communication smooth.",
    "supporting_bullets": [
      "You intuit what others need in the moment",
      "You shift tone or pace to create comfort",
      "You prioritise relational ease over conflict"
    ],
    "supporting_traits": [
      "Internal Framing",
      "Space-Making"
    ]
  },
  "P11": {
    "id": "P11",
    "title": "Emotional Decoding",
    "core_meaning": "Reads between every line.",
    "subtitle": "This pattern reflects your ability to translate subtle emotional information.",
    "insight": "You naturally decode tone, timing, and micro patterns. You see emotional meaning in details others might overlook.",
    "supporting_bullets": [
      "You interpret emotional signals from minimal data",
      "You sense shifts before they are verbalised",
      "You understand emotional subtext quickly"
    ],
    "supporting_traits": [
      "Vulnerability Matching",
      "Relational Tracking"
    ]
  },
  "P12": {
    "id": "P12",
    "title": "Detached Processing",
    "core_meaning": "Stays steady through analysis.",
    "subtitle": "This pattern reflects how you manage emotions by stepping into analysis.",
    "insight": "When things feel uncertain, you detach slightly and process logically. This helps you find stability before re engaging emotionally.",
    "supporting_bullets": [
      "You pause to think before reacting",
      "You separate emotion from decision making",
      "You return to connection once grounded"
    ],
    "supporting_traits": [
      "Social Mirroring",
      "Timing Sensitivity"
    ]
  }
}
